In [3]:
import pandas as pd
import sqlite3

In [4]:
df = pd.read_csv('data/tips.csv')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### Create sqlite database using files from folder 'data'

In [28]:
connect = sqlite3.connect('tips.db')
c = connect.cursor()
c.execute('''CREATE Table tips (total_bill, tip, sex, smoker, day, time, size)''')
connect.commit()
connect.close()

df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

#### Q1. Retrieve the average tip % for each day of the week

In [38]:
# Average tip % = The (sum of all tips of a particular day)* 100/ (sum of all total bills of a particular day) 

connect = sqlite3.connect('tips.db')
c = connect.cursor()
c.execute('''
    SELECT day, ROUND(SUM(tip)/SUM(total_bill)*100, 2) AS avg_tip
    FROM tips
    GROUP BY day
''')
df_avg_tip = pd.DataFrame(c.fetchall(), columns = ['day', 'average_tip'])
df_avg_tip

Empty DataFrame
Columns: [day, average_tip]
Index: []

#### Q2. Find the maximum and minimum total bull amounts

In [40]:

connect = sqlite3.connect('tips.db')
c = connect.cursor()
c.execute('''
    SELECT MAX(total_bill) AS max_bill, MIN(total_bill) As min_bill
    FROM tips
''')
df_bill = pd.DataFrame(c.fetchall(), columns = ['max_bill', 'min_bill'])
df_bill

  max_bill min_bill
0     None     None

#### Q3. Count the number of parties for each size

In [42]:
connect = sqlite3.connect('tips.db')
c = connect.cursor()
c.execute('''
    SELECT size, COUNT(size) AS count
    FROM tips
    GROUP BY size
''')
df_count = pd.DataFrame(c.fetchall(), columns = ['size', 'count'])
df_count

Empty DataFrame
Columns: [size, count]
Index: []

#### Q4. Retrieve the total bill and tip for parties of size 4 or more, where the tip percentage is greater than 15%

In [ ]:
connect = sqlite3.connect('tips.db')
c = connect.cursor()

c.execute('''
    SELECT * FROM tips WHERE size > 3 AND 

''')
print(c.fetchall())

connect.close()

#### Q5. Retrieve the total bill, tip amount, and tip % for each combination of day and time, sorted by tip % in descending order.